Repository: gyugyu86/Sash
Catalog: Sash/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans

source: A new version is available: %@
ja: 新しいバージョンがあります: %@
ko: 새 버전이 있습니다: %@
zh_hans: 有新版本可用：%@

source: Automatically check for updates
ja: 自動的にアップデートを確認
ko: 자동으로 업데이트 확인
zh_hans: 自动检查更新

source: Check for Updates…
ja: アップデートを確認…
ko: 업데이트 확인…
zh_hans: 检查更新…

source: Checking…
ja: 確認中…
ko: 확인 중…
zh_hans: 正在检查…

source: Couldn't check for updates.
ja: アップデートを確認できませんでした。
ko: 업데이트를 확인할 수 없습니다.
zh_hans: 无法检查更新。

source: Download
ja: ダウンロード
ko: 다운로드
zh_hans: 下载

source: Later
ja: 後で
ko: 나중에
zh_hans: 稍后

source: Updates
ja: アップデート
ko: 업데이트
zh_hans: 更新

source: When on, Sash contacts GitHub to fetch only the latest version number — no personal data is sent. Off by default.
ja: オンにすると、最新バージョン番号のみを GitHub から取得します（個人データは送信しません）。既定はオフです。
ko: 켜면 최신 버전 번호만 GitHub에서 가져옵니다(개인 데이터는 전송하지 않습니다). 기본값은 꺼짐입니다.
zh_hans: 开启后，Sash 会连接 GitHub 以获取最新版本号；不会发送任何个人数据。默认关闭。

source: You're up to date.
ja: 最新です。
ko: 최신 버전입니다.
zh_hans: 已是最新版本。

source: Find Sash in the list and turn it on. This window closes automatically once enabled.
ja: リストから Sash を見つけてオンにしてください。許可されると、この画面は自動的に閉じます。
ko: 목록에서 Sash를 찾아 켜 주세요. 허용되면 이 창은 자동으로 닫힙니다.
zh_hans: 在列表中找到 Sash 并开启它。授权后此窗口会自动关闭。

source: Open Accessibility Settings…
ja: アクセシビリティ設定を開く…
ko: 손쉬운 사용 설정 열기…
zh_hans: 打开“辅助功能”设置…

source: Permission granted
ja: 権限が付与されました
ko: 권한이 허용되었습니다
zh_hans: 权限已授予

source: Sash arranges your windows with the keyboard. To move other apps’ windows, it needs Accessibility permission.
ja: Sash はキーボードでウインドウを整えます。他アプリのウインドウを操作するには、アクセシビリティ権限が必要です。
ko: Sash는 키보드로 윈도우를 정리합니다. 다른 앱의 윈도우를 옮기려면 손쉬운 사용 권한이 필요합니다.
zh_hans: Sash 用键盘排列你的窗口。要移动其他 App 的窗口，需要辅助功能权限。

source: Waiting for permission…
ja: 権限を待っています…
ko: 권한을 기다리는 중…
zh_hans: 正在等待授权…

source: Welcome to Sash
ja: Sash へようこそ
ko: Sash에 오신 것을 환영합니다
zh_hans: 欢迎使用 Sash

source: A keyboard-first window manager for macOS.
ja: macOS 用のキーボード中心ウインドウマネージャ。
ko: 키보드 중심의 macOS 윈도우 관리자입니다.
zh_hans: 以键盘为中心的 macOS 窗口管理器。

source: About
ja: 情報
ko: 정보
zh_hans: 关于

source: Accessibility Permission
ja: アクセシビリティ権限
ko: 손쉬운 사용 권한
zh_hans: 辅助功能权限

source: Bottom Half
ja: 下半分
ko: 아래쪽 절반
zh_hans: 下半屏

source: Bottom Left
ja: 左下
ko: 왼쪽 아래
zh_hans: 左下

source: Bottom Right
ja: 右下
ko: 오른쪽 아래
zh_hans: 右下

source: Center Third
ja: 中央 1/3
ko: 가운데 1/3
zh_hans: 中间三分之一

source: Cycle
ja: サイクル
ko: 순환
zh_hans: 循环

source: Cycle width when pressing the same key
ja: 同じキーの連打で幅を循環
ko: 같은 키를 누르면 너비 순환
zh_hans: 按相同按键循环切换宽度

source: Gaps
ja: 余白
ko: 여백
zh_hans: 间距

source: General
ja: 一般
ko: 일반
zh_hans: 通用

source: Grant…
ja: 許可する
ko: 허용…
zh_hans: 授权…

source: Granted
ja: 許可済み
ko: 허용됨
zh_hans: 已授权

source: Language
ja: 言語
ko: 언어
zh_hans: 语言

source: Launch Sash at login
ja: ログイン時に Sash を起動
ko: 로그인 시 Sash 실행
zh_hans: 登录时启动 Sash

source: Left Half
ja: 左半分
ko: 왼쪽 절반
zh_hans: 左半屏

source: Left Third
ja: 左 1/3
ko: 왼쪽 1/3
zh_hans: 左三分之一

source: Left Two Thirds
ja: 左 2/3
ko: 왼쪽 2/3
zh_hans: 左三分之二

source: Maximize
ja: 最大化
ko: 최대화
zh_hans: 最大化

source: Move to Display %lld
ja: ディスプレイ %lld へ移動
ko: 디스플레이 %lld(으)로 이동
zh_hans: 移到显示器 %lld

source: Memory
ja: メモリ
ko: 메모리
zh_hans: 内存

source: Move to Next Display
ja: 次のディスプレイへ
ko: 다음 디스플레이로 이동
zh_hans: 移到下一个显示器

source: Move to Previous Display
ja: 前のディスプレイへ
ko: 이전 디스플레이로 이동
zh_hans: 移到上一个显示器

source: Not granted — Sash needs permission to move windows
ja: 未許可 — ウインドウ操作には許可が必要です
ko: 허용 안 됨 — 윈도우를 옮기려면 권한이 필요합니다
zh_hans: 未授权 — Sash 需要权限才能移动窗口

source: Pressing the same left/right key again steps the width: 1/2 → 2/3 → 1/3.
ja: 左/右キーを連打すると幅が 1/2 → 2/3 → 1/3 と循環します。
ko: 같은 왼쪽/오른쪽 키를 다시 누르면 너비가 1/2 → 2/3 → 1/3 순으로 바뀝니다.
zh_hans: 再次按相同的左/右按键会切换宽度：1/2 → 2/3 → 1/3。

source: Quit Sash
ja: Sash を終了
ko: Sash 종료
zh_hans: 退出 Sash

source: Report an Issue…
ja: 問題を報告…
ko: 문제 신고…
zh_hans: 报告问题…

source: Restore
ja: 元に戻す
ko: 복원
zh_hans: 还原

source: Right Half
ja: 右半分
ko: 오른쪽 절반
zh_hans: 右半屏

source: Right Third
ja: 右 1/3
ko: 오른쪽 1/3
zh_hans: 右三分之一

source: Right Two Thirds
ja: 右 2/3
ko: 오른쪽 2/3
zh_hans: 右三分之二

source: Sash collects no data.
ja: Sash はデータを収集しません。
ko: Sash는 데이터를 수집하지 않습니다.
zh_hans: Sash 不收集任何数据。

source: Settings…
ja: 設定…
ko: 설정…
zh_hans: 设置…

source: Show menu bar icon
ja: メニューバーにアイコンを表示
ko: 메뉴 막대에 아이콘 표시
zh_hans: 在菜单栏显示图标

source: Shortcuts
ja: ショートカット
ko: 단축키
zh_hans: 快捷键

source: Space between windows and screen edges when placing.
ja: 配置時にウインドウと画面端のあいだに設ける余白。
ko: 윈도우를 배치할 때 윈도우와 화면 가장자리 사이의 여백입니다.
zh_hans: 排列窗口时，窗口与屏幕边缘之间的间距。

source: System
ja: システム
ko: 시스템
zh_hans: 系统

source: Top Half
ja: 上半分
ko: 위쪽 절반
zh_hans: 上半屏

source: Top Left
ja: 左上
ko: 왼쪽 위
zh_hans: 左上

source: Top Right
ja: 右上
ko: 오른쪽 위
zh_hans: 右上

source: Version %@
ja: バージョン %@
ko: 버전 %@
zh_hans: 版本 %@

source: Window Placement
ja: ウインドウ配置
ko: 윈도우 배치
zh_hans: 窗口排列

source: Shortcuts keep working when the icon is hidden. Reopen Sash from Finder to bring the icon back.
ja: アイコンを非表示にしてもショートカットは有効です。Finder から Sash を再度開くとアイコンが戻ります。
ko: 아이콘을 숨겨도 단축키는 계속 작동합니다. Finder에서 Sash를 다시 열면 아이콘이 다시 표시됩니다.
zh_hans: 隐藏图标后快捷键仍然有效。从访达重新打开 Sash 即可让图标重新出现。
